""" 
基本的な命名規則として、v. X . Y . Z - 西暦下2桁.月.日 をmainブランチに対して設定する。（v3.4.5-2026.1.21）

X.Y.Zについて：
    Xはメジャーバージョンである。大きな変更が合った時に上げる。
    Yは次のマイナーバージョンである。普通の変更に対して設定する。
    Zはバグや表示修正など小さな変更に対して上げる。パッチとも云うかも。
        ここに英文字をつけて変更内容を表してもいい。
        A, X：複合的、その他
        B：バックエンド
        C：コメントアウト
        D : ドキュメント
        F：フロントエンド
        M：データベース
        
        
XやYが上がった時、また文化祭・体育祭前など開発が一段落した時にreleaseと併せて設定するといい。

詳しくはgithubを参照。

"""

RAKUNAVI_VERSION = "v4.14.1M-26.08.31"

"""
2026年1月21日に命名規則を変更したので、既存のものに対して現在のものを0と置くのも納得できず、
24年度のv24.10.4をメジャーバージョン1、25年度の体育祭追加前を2、追加後を3として、Яの追加で4とおくことにしました。
"""
